improve rpc commands
